CDiamondGit/stm32SpaceInvaders/src/main.c
/*
 * 1. INCLUDES & DEFINES
 */

#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <time.h>
#include <stdlib.h>
#include <stm32f031x6.h>
#include "display.h"
#include "musical_notes.h"
#include "serial.h"
#include "sound_effects.h"


/*----GAME
 * FUNCTIONALITY------------------------------------------______---------------------*/
#define SCORE_INC 10
#define MAX_RECORDS 5

/* --- Screen --------------------------------------------------------------- */
#define SCREEN_W 128
#define SCREEN_H 160

/* --- Ship ----------------------------------------------------------------- */
#define SHIP_W 12
#define SHIP_H 12
#define SHIP_MIN_X 2
#define SHIP_MAX_X (SCREEN_W - SHIP_W - 2)
#define SHIP_SPEED 2

/* --- Bullet --------------------------------------------------------------- */
#define BULLET_W 2
#define BULLET_H 2
#define BULLET_OFFSET_X 6
#define BULLET_OFFSET_Y 13
#define BULLET_SPEED 4
#define ALIEN_BULLET_SPEED 1
#define BULLET_COLOR 65287
#define ALIEN_BULLET_COLOR 57034

/* --- Alien grid ----------------------------------------------------------- */
#define ALIEN_W 11
#define ALIEN_H 8
#define ALIEN_ROWS 3
#define ALIEN_COLS 5
#define ALIEN_GAP_X 11    /* horizontal gap between aliens          */
#define ALIEN_GAP_Y 5     /* vertical gap between aliens            */
#define ALIEN_ORIGIN_X 12 /* grid left edge at game start           */
#define ALIEN_ORIGIN_Y 20 /* grid top  edge at game start           */

#define ALIEN_GRID_W \
  (ALIEN_COLS * (ALIEN_W + ALIEN_GAP_X) - ALIEN_GAP_X) /* 75 */
#define ALIEN_GRID_H \
  (ALIEN_ROWS * (ALIEN_H + ALIEN_GAP_Y) - ALIEN_GAP_Y) /* 34 */

/* Movement bounds for the grid origin (left edge of col-0) */
#define ALIEN_MIN_X 2
#define ALIEN_MAX_X (SCREEN_W - ALIEN_GRID_W - 2)

/* How many pixels the grid shifts per move tick, and ms between ticks */
#define ALIEN_STEP 5
#define ALIEN_MOVE_MS \
  1000 /* decrease speeds up alien and increase to slow down          */

/* Drop distance when hitting a wall (one alien row + gap) */
#define ALIEN_DROP (ALIEN_H + ALIEN_GAP_Y)

/* --- HUD ------------------------------------------------------------------ */
#define HUD_LINE_Y 144
#define HUD_LINE_COLOR 57351

#define ALIEN_FIRE_MIN_MS 800
#define ALIEN_FIRE_MAX_MS 3000


/* --- Loading Bar ----------------------------------------------------------- */
#define LBAR_X       20
#define LBAR_Y       100
#define LBAR_W       200
#define LBAR_H       20

#define LBAR_BACKGROUND      0x0000   // black (bakcground)
#define LBAR_FILL    0x07E0   // green

#define STAR_RED    63680
#define STAR_BLUE   1119
#define STAR_WHITE  65535



/*
 * TYPE DECLARATIONS
 */

/* --- Bullet / game object types ------------------------------------------ */
typedef enum { BULLET_READY, BULLET_FIRE } BulletState;

typedef struct {
  uint16_t x, y;
  uint16_t oldX, oldY;
} Transform;

typedef struct {
  Transform coords;
  uint16_t speed;
} Ship;

typedef struct {
  Transform coords;
  BulletState state;
  uint16_t speed;
} Bullet;

typedef struct {
  char initials[4]; /* 3 letters + null terminator */
  uint32_t score;
} ScoreRecord;

/* --- Alien formation ------------------------------------------------------ */
typedef struct {
  int16_t offsetX, offsetY;
  int16_t oldOffsetX, oldOffsetY;
  int8_t dirX;
  uint32_t lastMoveTime;
  uint8_t status[ALIEN_ROWS][ALIEN_COLS];
  uint16_t basePosX[ALIEN_COLS];
  uint16_t basePosY[ALIEN_ROWS];
  int8_t earToggle;
  Bullet ab[ALIEN_COLS];
  uint32_t nextFireTime[ALIEN_COLS];
} AlienGrid;

/* --- Whole game state ----------------------------------------------------- */
typedef struct {
  Ship ship;
  Bullet bullet;
  AlienGrid aliens;
  int lives;
  int score;
  int highScore;
} GameState;

/* --- App / gameplay states ------------------------------------------------ */
typedef enum { MAINMENU, PLAYING, HELP, RECORD } AppState;

typedef enum { GAMERUNNING, PAUSE, GAMEOVER } PlayingState;

/*
 * FUNCTION PROTOTYPES
 */

/* --- Sound / timing / interrupts ----------------------------------------- */
void start_sound_effect_ch1(const uint32_t notes[],
                            const uint32_t times[],
                            uint32_t count,
                            uint32_t repeat);
void start_sound_effect_ch2(const uint32_t notes[],
                            const uint32_t times[],
                            uint32_t count,
                            uint32_t repeat);
void SysTick_Handler(void);
static void stop_sound_effect_ch1(void);
static void stop_sound_effect_ch2(void);

/* --- Hardware setup ------------------------------------------------------- */
void pinMode(GPIO_TypeDef* port, uint32_t pin, uint32_t mode);
static void enablePullUp(GPIO_TypeDef* port, uint32_t pin);
static void initClock(void);
static void initSysTick(void);
static void setupIO(void);

/* --- Utility / timing / random ------------------------------------------- */
void delay(volatile uint32_t ms);
uint32_t xorshift32(void);
static uint8_t shouldFire(uint8_t threshold);
static uint32_t randomFireDelay(void);
uint8_t get_random_bit(uint32_t* state);
int isInside(uint16_t x1,
             uint16_t y1,
             uint16_t w,
             uint16_t h,
             uint16_t px,
             uint16_t py);

/* --- Background / screen helpers ----------------------------------------- */
void loadBackground(void);
void clearDisplay(void);

/* --- Game initialisation -------------------------------------------------- */
static void parkAlienBullet(int col);
static void initAlienGrid(void);
static void initGameState(void);
static void resetGame(void);

/* --- Menu / app state screens -------------------------------------------- */
void mainMenu(AppState* as);
void help(AppState* as);
void getPause(PlayingState* ps, AppState* as);
void playing(AppState* as);

/* --- Input ---------------------------------------------------------------- */
static void handleInput(PlayingState* ps, AppState* as);

/* --- Alien movement / firing --------------------------------------------- */
static int isAlienGridMt(void);
static uint16_t getLowestAlienY(void);
static void moveAliens(uint32_t now);
static void updateAlienFire(uint32_t now);

/* --- Collision / bullet state -------------------------------------------- */
static int checkCollision(uint16_t o1X,
                          uint16_t o1Y,
                          uint16_t o1w,
                          uint16_t o1h,
                          uint16_t o2X,
                          uint16_t o2Y,
                          uint16_t o2w,
                          uint16_t o2h);
static void resetAlienBullet(int col);
static void resetPlayerBullet(void);
static void repairAliensUnderRect(uint16_t rx,
                                  uint16_t ry,
                                  uint16_t rw,
                                  uint16_t rh);
static int updateAlienBulletCollision(void);
static void updatePlayerCollision(void);
static int checkGameOver(void);

/* --- Rendering ------------------------------------------------------------ */
static void renderAliens(void);
static void renderShip(void);
static void renderPlayerBullet(void);
static void renderAlienBullets(void);
static void renderBarricade(void);
static void renderScene(void);
static void renderStats(void);
static void renderGameOverScreen(PlayingState* ps, AppState* as);
static void splashScreen();
static void makeBackground(int starCount);

