CDiamondGit/stm32SpaceInvaders/src/main.c
  // Set LEDs based on lives
  GPIOA->ODR |= (lives >= 1) ? (1 << 1) : 0;
  GPIOB->ODR |= (lives >= 2) ? (1 << 3) : 0;
  GPIOA->ODR |= (lives == 3) ? (1 << 2) : 0;
}
/* --- Utility / timing / random -------------------------------------------
 */
void delay(volatile uint32_t ms) {
  uint32_t end = ms + milliseconds;
  while (milliseconds != end)
    __asm(" wfi ");
}
uint32_t xorshift32() {
  randState ^= randState << 13;
  randState ^= randState >> 17;
  randState ^= randState << 5;
  return randState;
}
static uint8_t shouldFire(uint8_t threshold) {
  return (xorshift32() % threshold) ==
         0;  // threshold => more higher less likely to fire
  /*
  threshold = 3:
  possible results of % 3 → { 0, 1, 2 }
  only 0 returns 1 → 1 in 3 chance = 33%
  */
}
static uint32_t randomFireDelay(void) {
  uint32_t range = ALIEN_FIRE_MAX_MS - ALIEN_FIRE_MIN_MS;
  return ALIEN_FIRE_MIN_MS + (xorshift32() % range);
}
uint8_t get_random_bit(uint32_t* state) {
  (void)state;
  return xorshift32() & 1u;
}
int isInside(uint16_t x1,
             uint16_t y1,
             uint16_t w,
             uint16_t h,
             uint16_t px,
             uint16_t py) {
  return (px >= x1 && px <= x1 + w && py >= y1 && py <= y1 + h) ? 1 : 0;
}

/* --- Background / screen helpers ----------------------------------------- */
void loadBackground() {
  makeBackground(40);
  printTextBold("Space", 10, 10, 1, 0);
  printTextBold("Invader", 40, 20, 1, 0);

  // putImage(0, 0, 128, 50, top_background, 1, 0);
  // putImage(110, 0, 128,50, bottom_background, 1, 0);
}
void clearDisplay() {
  fillRectangle(0, 0, SCREEN_W, SCREEN_H, 0);
}

/* --- Game initialisation -------------------------------------------------- */
static void parkAlienBullet(int col) {
  AlienGrid* ag = &gs.aliens;
  Bullet* b = &ag->ab[col];

  // find the bottom alive alien in the column

  int row = -1;
  for (int i = ALIEN_ROWS - 1; i >= 0; i--) {
    if (ag->status[i][col] == 0) {
      row = i;
      break;
    }
  }

  // no
  if (row == -1) {
    b->state = BULLET_READY;
    return;
  }

  b->coords.x = b->coords.oldX =
      (uint16_t)(ag->offsetX + ag->basePosX[col] + BULLET_OFFSET_X);
  b->coords.y = b->coords.oldY =
      (uint16_t)(ag->offsetY + ag->basePosY[row] + ALIEN_H);

  b->speed = ALIEN_BULLET_SPEED;
  b->state = BULLET_READY;
}
static void initAlienGrid() {
  AlienGrid* ag = &gs.aliens;
  ag->offsetX = ag->oldOffsetX = ALIEN_ORIGIN_X;
  ag->offsetY = ag->oldOffsetY = ALIEN_ORIGIN_Y;
  ag->dirX = -1; /* start moving right */
  ag->earToggle = 0;
  ag->lastMoveTime = 0;

  /* Precompute relative per-cell offsets (never change during play) */
  for (int i = 0; i < ALIEN_ROWS; i++)
    ag->basePosY[i] = (uint16_t)(i * (ALIEN_H + ALIEN_GAP_Y));
  for (int j = 0; j < ALIEN_COLS; j++)
    ag->basePosX[j] = (uint16_t)(j * (ALIEN_W + ALIEN_GAP_X));

  // putImage((uint16_t)(ag->offsetX + ag->basePosX[j]),
  //                (uint16_t)(ag->offsetY + ag->basePosY[i]), ALIEN_W, ALIEN_H,
  //                redAlien[ag->earToggle], 1, 0);

  /* All aliens alive */
  for (int i = 0; i < ALIEN_ROWS; i++)
    for (int j = 0; j < ALIEN_COLS; j++)
      ag->status[i][j] = 0;

  for (int i = 0; i < ALIEN_COLS; i++) {
    parkAlienBullet(i);
    ag->nextFireTime[i] = milliseconds + randomFireDelay();
  }
}
static void initGameState(void) {
  gs.highScore = records[0].score;
  randState = milliseconds | 1; /* Ship */

  gs.ship.coords.x = gs.ship.coords.oldX = 58;
  gs.ship.coords.y = gs.ship.coords.oldY = 130;
  gs.ship.speed = SHIP_SPEED;

  /* Bullet - parked at muzzle */
  gs.bullet.coords.x = gs.bullet.coords.oldX =
      gs.ship.coords.x + BULLET_OFFSET_X;
  gs.bullet.coords.y = gs.bullet.coords.oldY =
      gs.ship.coords.y - BULLET_OFFSET_Y;
  gs.bullet.speed = BULLET_SPEED;
  gs.bullet.state = BULLET_READY;

  /* Alien grid */
  initAlienGrid();
}
static void resetGame(void) {
  /* Blank the whole play area above the HUD line */
  fillRectangle(0, 0, SCREEN_W, HUD_LINE_Y, 0);

  /* Re-initialise all game state */
  initGameState();

  /* Redraw the initial scene */
  renderAliens();
  putImage(gs.ship.coords.x, gs.ship.coords.y, SHIP_W, SHIP_H, spaceShip, 1, 0);
  /* HUD line stays - was never erased */
}

/* --- Menu / app state screens -------------------------------------------- */
void mainMenu(AppState* as) {
  clearDisplay();

  loadBackground();

  int selectedOption = 0;

  uint16_t normal = RGBToWord(0xff, 0xff, 0);
  uint16_t highlighted = RGBToWord(211, 211, 211);
  uint16_t startButton = normal;
  uint16_t helpButton = normal;
  uint16_t scoreButton = normal;

  int done = 0;

  while (!done) {
    char c = 0;
    if (serialCharAvailable()) {
      c = serialGetCharNonBlocking();
    }

    if (selectedOption == 0) {
      startButton = highlighted;
      helpButton = normal;
      scoreButton = normal;
    }
    if (selectedOption == 1) {
      helpButton = highlighted;
      scoreButton = normal;
      startButton = normal;
    }
    if (selectedOption == 2) {
      scoreButton = highlighted;
      startButton = normal;
      helpButton = normal;
    }

    printText("Start Game", 20, 60, startButton, 0);
    printText("Help", 20, 80, helpButton, 0);
    printText("High Scores", 20, 100, scoreButton, 0);

    if (((GPIOA->IDR & (1 << 11)) == 0) || c == 's' || c == 'S') {
      if (selectedOption < 2) {
        selectedOption++;
        delay(100);
      }
    }

    if (((GPIOA->IDR & (1 << 8)) == 0) || c == 'w' || c == 'W') {
      if (selectedOption > 0) {
        selectedOption--;
        delay(100);
      }
    }

    if (((GPIOB->IDR & (1 << 4)) == 0) || c == ' ' || c == '\r' || c == '\n' ||
        c == 'd' || c == 'D') {
      if (selectedOption == 0) {
        *as = PLAYING;
        done = 1;
      }
      if (selectedOption == 1) {
        *as = HELP;
        done = 1;
      }
      if (selectedOption == 2) {
        *as = RECORD;
        done = 1;
      }
    }
  }
}
void help(AppState* as) {
  clearDisplay();

  int done = 0;

  while (!done) {
    char c = 0;
    if (serialCharAvailable()) {
      c = serialGetCharNonBlocking();
    }

    printTextX2("HELP", 40, 0, RGBToWord(255, 255, 0), 0);

    printText("Control spaceship:", 0, 20, RGBToWord(255, 255, 255), 0);
    printText("Left/Right buttons", 0, 30, RGBToWord(255, 255, 255), 0);
    printText("FIRE = UP BUTTON", 0, 60, RGBToWord(255, 255, 255), 0);
    printText("PAUSE = DOWN BUTTON", 0, 80, RGBToWord(255, 255, 255), 0);

