CDiamondGit/stm32SpaceInvaders/src/main.c
  int16_t dx = (int16_t)gs.ship.coords.x - gs.ship.coords.oldX;

  if (dx > 0)
    fillRectangle(gs.ship.coords.oldX, gs.ship.coords.oldY, (uint16_t)dx,
                  SHIP_H, 0);
  else if (dx < 0)
    fillRectangle(gs.ship.coords.x + SHIP_W, gs.ship.coords.oldY,
                  (uint16_t)(-dx), SHIP_H, 0);

  gs.ship.coords.oldX = gs.ship.coords.x;
  gs.ship.coords.oldY = gs.ship.coords.y;
  putImage(gs.ship.coords.x, gs.ship.coords.y, SHIP_W, SHIP_H, spaceShip, 1, 0);
}
/*
Erase tail strip only, draw new bullet head
*/
static void renderPlayerBullet(void) {
  if (gs.bullet.state != BULLET_FIRE)
    return;

  Bullet* b = &gs.bullet;
  fillRectangle(b->coords.oldX, b->coords.oldY + BULLET_H, BULLET_W, b->speed,
                0);
  b->coords.oldX = b->coords.x;
  b->coords.oldY = b->coords.y;
  fillRectangle(b->coords.x, b->coords.y, BULLET_W, BULLET_H, BULLET_COLOR);
}
static void renderAlienBullets(void) {
  AlienGrid* ag = &gs.aliens;
  for (int j = 0; j < ALIEN_COLS; j++) {
    Bullet* b = &ag->ab[j];
    if (b->state != BULLET_FIRE)
      continue;

    /* 1. Erase old position */
    fillRectangle(b->coords.oldX, b->coords.oldY, BULLET_W, BULLET_H, 0);

    /* 2. Repair aliens whose pixels the erase may have destroyed */
    repairAliensUnderRect(b->coords.oldX, b->coords.oldY, BULLET_W, BULLET_H);

    /* 3. Draw bullet at new position */
    b->coords.oldX = b->coords.x;
    b->coords.oldY = b->coords.y;
    fillRectangle(b->coords.x, b->coords.y, BULLET_W, BULLET_H,
                  ALIEN_BULLET_COLOR);
  }
}
static void renderBarricade() {
  fillRectangle(20, 115, 20, 10, 51975);
}

static void renderGameOverScreen(PlayingState* ps, AppState* as) {
  getPause(ps, as);
}

static void renderStats(void) {
  printText("S:", 83, HUD_LINE_Y + 5, RGBToWord(128, 0, 128), 0);
  printNumber((uint16_t)gs.score, 95, HUD_LINE_Y + 5, RGBToWord(128, 0, 128),

              0);
  printText("HS:", 2, HUD_LINE_Y + 5, RGBToWord(128, 0, 128), 0);
  printNumber((uint16_t)gs.highScore, 22, HUD_LINE_Y + 5,
              RGBToWord(128, 0, 128), 0);
}
/*
Top-level render dispatcher
*/
static void renderScene(void) {
  renderAliens(); /* no-op internally if grid didn't move this frame */
  renderShip();
  renderPlayerBullet();
  renderAlienBullets();
  renderStats();
}


static void makeBackground(int starCount) {

  srand(time(NULL));

 for (uint16_t i = 0; i < starCount; ++i) {
        uint16_t x = (uint16_t)(rand() % SCREEN_W);
        uint16_t y = (uint16_t)(rand() % SCREEN_H);

        int r = rand() % 3; 
        uint16_t colour;
        if (r==0) {
          colour = STAR_RED;
        } else if (r==1) {
          colour = STAR_BLUE;
        } else {
          colour = STAR_WHITE;
        }

        putPixel(x, y, colour);
    }


}


/*
Splash screen with loading bar
*/

 static void splashScreen() {
    // Clear display as precaution
    clearDisplay();

    //Create the starry background
    makeBackground(30);

    // Create loadedBit variable to make the amount of bit variables there will be (Make it progress smoothly)
    const int loadedBit = 50;
    // Pixels loaded per individual loaded bit
    const uint16_t bitWidth = LBAR_W / loadedBit;
    // delay until three seconds
    const uint16_t delayMs = 3000 / loadedBit;

   //Draw the bar background
    drawRectangle(LBAR_X, LBAR_Y, LBAR_W, LBAR_H, LBAR_BACKGROUND);

  //Animate the filling of the background
    for (int i = 0; i <= loadedBit; i++) {

        int w = i * bitWidth;

        // Draw the filled percentage 
        drawRectangle(LBAR_X, LBAR_Y, w, LBAR_H, LBAR_FILL);
        // Delay to make look like loading
        delay(delayMs);
    }
}
